In [75]:
import pandas as pd
import numpy as np
import seaborn as sns

dd=pd.DataFrame(columns=["Nufus","Kürt"],data=[[1500,700],[2500,250]])
dd["Türk"]=dd["Nufus"]-dd["Kürt"]
cc=sns.load_dataset("car_crashes")
cc.set_index(["abbrev","total"],inplace=True)
cc.mean(level="total")

emp=pd.DataFrame(columns=["ad","ülke"],data=[["Mustafa","Türkiye"],["Ali","Amerika"]])
emp_sa=pd.DataFrame(columns=["ad","maas"],data=[["Mustafa",15000],["Ali",2052]])
pd.merge(left=emp,right=emp_sa,on="ad")
gp=pd.read_csv("gp.csv")
gp_1=pd.read_csv("gp_1.csv")

g=gp[0:4]
#pd.merge(gp,gp_1,on="App")
d=gp_1[gp_1.App=="Coloring book moana"]
ne=pd.merge(d,g)
ne.set_index("App",inplace=True)
ne.pivot_table(columns=["App"])

App                     Coloring book moana
Rating                             3.900000
Sentiment_Polarity                 0.152652
Sentiment_Subjectivity             0.641540

In [88]:
eng=pd.DataFrame(columns=["Property","Price"],data=[["Table",2500],["Notebook",5220]])
turk=pd.DataFrame(columns=["Eşya","Boyut"],data=[["Table",2.5],["Notebook",3.5]])
pd.merge(eng,turk,left_on="Property",right_on="Eşya").drop("Property",axis=1).rename({"Price":"Eder"})

   Price      Eşya  Boyut
0   2500     Table    2.5
1   5220  Notebook    3.5

In [94]:
turkce=pd.DataFrame(columns=["Ad","Not"],data=[["Ali",90],["Fırat",15],["Veli",90]])
mat=pd.DataFrame(columns=["Ad","Not"],data=[["Ali",80],["Fırat",25],["Derya",20]])

pd.merge(left=turkce,right=mat,left_on="Ad",right_on="Ad",suffixes=["_Turkce","_Matematik"])

      Ad  Not_Turkce  Not_Matematik
0    Ali          90             80
1  Fırat          15             25

In [116]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
pop
#abbrevs
a=pd.merge(pop,abbrevs,left_on="state/region",right_on="abbreviation")
a.merge(areas).drop("state/region",axis=1,inplace=True)
a
areas
pd.merge(left=areas,right=abbrevs).head()

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA